<?php
function faculty($cid){
    if($cid==31)
        echo<<<std
                <h3>新型光器件与光交换研究组简介</h3>
                <p>电子科技大学新型光器件与光交换研究组主要面向光纤通信领域开展相关基础理论研究和产品技术开发，是光纤传感与通信教育部重点实验室的重要支撑力量之一，隶属于通信与信息工程学院。</p>
                <p>研究组现有专任教师6人，教授3人，副教授1人，讲师2人，全部具有国内或国际重点高校博士学位；已培养近50名该研究方向的硕博士研究生，海外联合培养研究生多名，在研的博士研究生8人、硕士研究生15余人。</p>
                <p>近几年，承担了国家重点基础研究发展计划(973)子项目、国家高新技术研究发展计划(863)项目、国家自然科学基金国际合作项目、面上项目、青年基金项目等在内的国家级科研课题10余项；申请发明专利30余项，已授权近20项，研究成果获得四川省科技进步一等奖。</p>
                <p>目前，研究组主要研究新型光信息处理器件和光子交换集成芯片，具体包括：
                    <p>（1）光子信息处理与控制理论与技术</p>
                    <p>（2）光控光非线性机理与超快光学</p>
                    <p>（3）基于光纤参量振荡器（FOPO）的全光时钟提取</p>
                    <p>（4）多波长全光再生器理论与技术</p>
                    <p>（5）多功能磁控光信号处理器件开发</p>
                    <p>（6）高阶调制信号的全光再生方案实现</p>
                    <p>（7）硅基可再生光交换多功能集成芯片</p>
                    <p>（8）OBS/OPS光交换网络及其控制算法等</p>
                </p>
                <p>欢迎有志于从事光纤通信、信息处理、通信网络、光子芯片等方向的优秀学子加盟，我们招收硕士/博士研究生的专业是“通信与信息系统专业”，联系我们可发送邮件到bjwu@uestc.edu.cn，谢谢！</p>
std;
    else if($cid==32)
        echo <<<std
         <div class="detail">
                <div class="detail_t">
                    <img src="uploads/teacher/qk.png" alt="邱昆"/>
                    <ul style="display: none;">
                        <li>性别：男</li>
                        <li>出生年月：</li>
                        <li>职称：教授/博导</li>
                        <li>邮箱：kqiu@uestc.edu.cn</li>
                    </ul>
                </div>
                <div class="detail_b">
                    <p style="color:blue;font-size:16px;text-indent:0;">邱昆  教授 (二级)  博士生导师</p>
                    <p>入选“新世纪百千万人才工程”国家级人选，获得教育部首届“青年教师奖”，四川省青年科技奖。曾任国家863-317第三、四届光纤通信专业专家组成员，曾获电子部优秀科技青年、四川省电子工业优秀科技工作者、四川省有突出贡献的专家、成都市优秀青年等称号。
                        担任四川省科技青年联合会副主席，中国电子学会高级会员、青年委员会委员，中国通信学会高级会员、光通信委员会委员，中国光学学会高级会员、纤维光学与集成光学专委会委员，美国IEEE会员（曾担任IEEE PHOTONICS SOCIETY CHENGDU CHAPTER 主席）。 </p>
                    <p>发表科研论文300多篇，出版“光纤通信导论”、“光纤通信系统”两部著作和“十一五”国家级规划教材“光纤通信”。申请国家发明专利二十多项，其中已获授权十项。九次获得省部级科技进步奖，包括：“微波副载波调频CATV实用化光传输系统”获电子部科技进步二等奖，“基于光码分复用的新型光分组交换与无源光网络技术”获四川省科技进步一等奖。“宽带光纤传输系统”获四川省科技进步二等奖，“半导体激光器产生与调制超短光脉冲研究”获国家教委科技进步二等奖, “实用化掺铒光纤放大器”获电子部科技进步三等奖，“光放大理论及其应用”获四川省科技进步二等奖,“EPON光纤传输系统” 获四川省科技进步二等奖。</p>
                    <p>联系方式：(办公室)科研楼B225，kqiu@uestc.edu.cn，028-61831816(O)</p>
                </div>
            </div>
    <div class="detail">
                <div class="detail_t">
                    <img src="uploads/teacher/wbj.png" alt="武保剑"/>
                    <ul style="display: none;">
                        <li>性别：男</li>
                        <li>出生年月：</li>
                        <li>职称：教授/博导</li>
                        <li>邮箱：bj_wu@uestc.edu.cn</li>
                    </ul>
                </div>
                <div class="detail_b">
                    <p style="color:blue;font-size:16px;text-indent:0;">武保剑 教授   博士生导师</p>
                    <p>入选新世纪优秀人才计划、四川省学术和技术带头人后备人选。 1999年上海交通大学博士毕业后在大唐电信光通信公司从事宽带光纤接入产品的研究开发工作。2003年5月到电子科技大学通信与信息工程学院，主要从事微波磁光学、光纤通信技术、智能光信息处理、光子集成芯片等方面的教学与科研工作。 2010年到威尔士大学进行高级研究学术访问。</p>
        <p>主持国家自然科学基金项目3项、国家863课题2项、新世纪优秀人才支持计划项目1项，主研四川省应用基础研究项目、国家863其它项目以及国家973课题等多项。 </p>
        <p>出版学术专著《微波磁光理论与磁光信号处理》和《光纤信息处理原理与技术》，发表学术论文100余篇。2007年获四川省科学技术二等奖。</p>
                    <p>联系方式：(办公室)科研楼B223B，bjwu@uestc.edu.cn，028-61830268(O)</p>
                </div>
            </div>
std;
   else echo<<<std
                <ul>
                    <li>
                        <div class="fl"><a href="">清水河拨号上网登录器</a></div>
                        <div class="fr">2015年12月1日</div>
                    </li>
                    <li>
                        <div class="fl"><a href="">清水河拨号上网登录器</a></div>
                        <div class="fr">2015年12月1日</div>
                    </li>
                    <li>
                        <div class="fl"><a href="">清水河拨号上网登录器</a></div>
                        <div class="fr">2015年12月1日</div>
                    </li>
                    <li>
                        <div class="fl"><a href="">清水河拨号上网登录器</a></div>
                        <div class="fr">2015年12月1日</div>
                    </li>
                    <li>
                        <div class="fl"><a href="">清水河拨号上网登录器</a></div>
                        <div class="fr">2015年12月1日</div>
                    </li>
                    <li>
                        <div class="fl"><a href="">清水河拨号上网登录器</a></div>
                        <div class="fr">2015年12月1日</div>
                    </li>
                    <li>
                        <div class="fl"><a href="">清水河拨号上网登录器</a></div>
                        <div class="fr">2015年12月1日</div>
                    </li>
                    <li>
                        <div class="fl"><a href="">清水河拨号上网登录器</a></div>
                        <div class="fr">2015年12月1日</div>
                    </li>
                    <li><a href="">清水河拨号上网登录器</a></li>
                    <li><a href="">清水河拨号上网登录器</a></li>
                    <li><a href="">清水河拨号上网登录器</a></li>
                </ul>
std;
}

?>